##### **Q1(a). Read the above excel file in python.**

In [1]:
import pandas as p

In [2]:
data_excel = p.read_excel("file.xlsx")

##### **Q1(b). How do I write this file to a new file “new.csv”?**

In [3]:
data_excel.to_csv("new.csv", index=False)

##### **Q1(c). Include column names in this file. Use ‘ticker’, ‘eps’, ‘revenue’, ‘price’, ‘people’ as column names.**

In [4]:
data_csv=p.read_csv("new.csv")
data_csv.rename(columns={
                        "Unnamed: 0" : "Ticker",
                        "Unnamed: 1" : "Eps",
                        "Unnamed: 2" : "Revenue",
                        "Unnamed: 3" : "Price",
                        "Unnamed: 4" : "People"},inplace=True)

In [5]:
data_csv

    Ticker    Eps  Revenue Price         People
0   GOOGLE  27.82       87   845     Larry Page
1      WMT   4.61      484    65           n.a.
2     MSFT     -1       85    64     Bill Gates
3      RIL   n.a.       50  1023  Mukesh Ambani
4     TATA    5.6       -1  n.a.     Ratan Tata

##### **Q1(d). Convert all not available or n.a. values to NAN and also convert negative revenues to NAN because revenues can never be negative.**

In [6]:
import numpy as np
data_csv.replace("n.a.", np.nan, inplace=True)
data_csv['Revenue'].replace(-1, np.nan, inplace=True)
data_csv

    Ticker    Eps  Revenue Price         People
0   GOOGLE  27.82     87.0   845     Larry Page
1      WMT   4.61    484.0    65            NaN
2     MSFT     -1     85.0    64     Bill Gates
3      RIL    NaN     50.0  1023  Mukesh Ambani
4     TATA    5.6      NaN   NaN     Ratan Tata

##### **Q1(e). Fill NAN values using a suitable approach.**

In [7]:
data_csv = data_csv.fillna(data_csv.median())
data_csv

C:\Users\HP\AppData\Local\Temp\ipykernel_5628\2433776423.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data_csv = data_csv.fillna(data_csv.median())

    Ticker    Eps  Revenue  Price         People
0   GOOGLE  27.82     87.0    845     Larry Page
1      WMT   4.61    484.0     65            NaN
2     MSFT     -1     85.0     64     Bill Gates
3      RIL  5.105     50.0   1023  Mukesh Ambani
4     TATA    5.6     86.0  455.0     Ratan Tata

##### **Q1(f). Write a function to change n.a value appearing in WMT to Sam Walton.**

In [8]:
def update_value(df, condition, newname):
    df.loc[df['Ticker'] == condition, 'People'] = newname
    return df

In [9]:
update_value(data_csv, 'WMT', 'Sam Walton')

    Ticker    Eps  Revenue  Price         People
0   GOOGLE  27.82     87.0    845     Larry Page
1      WMT   4.61    484.0     65     Sam Walton
2     MSFT     -1     85.0     64     Bill Gates
3      RIL  5.105     50.0   1023  Mukesh Ambani
4     TATA    5.6     86.0  455.0     Ratan Tata